[
  {
    "avatar": "/img/emp/abhishek.png",
    "author": "Abhishek Mohanty",
    "designation": "Lead - Product Management",
    "testimonial": "During MBA, finance was my first area of interest. I always kept myself updated about the latest happenings in BFS. Learning new concepts and analysing the stock markets was my passion. Then came FLIP, <b>offering me a role which was completely in line with my passion</b>. I was asked to manage their entire course library.<br /> <br />Working in this profile for the past 3 years, <b>my knowledge in finance domain got enhanced</b>. I also learnt analysing financial statements and equity markets in a better way. It's been a wonderful journey and I am happy with the learning curve I am going through."
  },
  {
    "avatar": "/img/emp/sarprit.png",
    "author": "Sarprit Kaur",
    "designation": "Manager & Lead - Product Development",
    "testimonial": "Like any other fresher, I was not sure about my strengths and weakness. FLIP <b>helped me identify my qualities</b> and gave me support to work on them. One of the major ways was entrusting me with the responsibility of <b>leading a team</b> only after 2 years of experience. I believe this is possible only in FLIP."
  },
  {
    "avatar": "/img/emp/arijit.png",
    "author": "Arijit Mitra",
    "designation": "Manager & Lead - LDM",
    "testimonial": "FLIP is the <b>best place to start your professional career</b>. I joined FLIP after my MBA as Management Trainee in Production Team and currently leading the LDM Team. When my friends at other organisations were getting bored by doing the same work day in & day out, I was loving every single moment here – as I got to work in different verticals and each opportunity came along with different set of challenges which helped me in <b>improving my professional skills</b>."
  },
  {
    "avatar": "/img/emp/akhila.png",
    "author": "Akhila B.N",
    "designation": "Sr. Executive - LDM",
    "testimonial": "When I decided to move to Mysore, I was not quite convinced about how I would adjust. But working at <b>FLIP made it much easier</b>. My colleagues are fun to work with. We work hard and party harder! We get to speak out our ideas and are given equal importance. <br /> <br />Thank you FLIP for being there for me. I have been a part of LDM Team for 4 years now and I can’t get enough. Speaking to our clients / users and giving them the best learning experience is my ultimate goal."
  },
  {
    "avatar": "/img/emp/nidhi.png",
    "author": "Nidhi Jha",
    "designation": "Assistant Manager - Product Development",
    "testimonial": "During MBA, I was confused about my career path. I had good analytical skills and interest in finance, but I found the core finance jobs to be slightly boring. <b>FLIP offered a job profile where I could use both my knowledge of finance and my creativity</b>. Along with this, my current role also gives me the opportunity to keep my entrepreneurial side alive, since I get to test new waters and take full responsibility of my projects."
  }
]
